In [ ]:
#count encoding

In [3]:
encdata=pd.read_csv("all_data.csv",usecols=['district','region'])

In [4]:
for col in encdata.columns[0:]:
    print(col,': ',len(encdata[col].unique()), 'labels')

district :  121 labels
region :  22 labels

In [5]:
#obtaining counts
encmap =encdata.region.value_counts().to_dict()

In [6]:
encdata.region = encdata.region.map(encmap)
encdata.head()

         district  region
0          Kasulu     238
1        Zanzibar     637
2  Morogoro Urban     305
3          Karatu     368
4          Mpanda     730

In [7]:
encmap1 =encdata.district.value_counts().to_dict()
encdata.district = encdata.district.map(encmap1)
encdata.head()

   district  region
0        87     238
1       611     637
2        47     305
3        42     368
4       278     730

In [27]:
dat=pd.read_csv("dataa.csv")
datt=pd.read_csv("test.csv")

In [28]:
all_data = pd.concat((dat, datt)).reset_index(drop=True)
print("all_data size is : {}".format(all_data.shape))

all_data size is : (9459, 26)

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [29]:
all_data['district']=encdata['district']
all_data['region']=encdata['region']

In [30]:
daat=pd.read_csv("all.csv")

In [31]:
daat.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [32]:
all_data['ward']=daat['ward']

In [33]:
#####
import pandas as pd
import numpy as np

In [34]:
data = pd.read_csv("alltrain.csv")
test = pd.read_csv("alltest.csv")

In [35]:
dat1= pd.read_csv("trainagent.csv")
test1= pd.read_csv("testagent.csv")

In [36]:
dat1.head()

         standalone_agent
0  Conduct other business
1  Conduct other business
2  Conduct other business
3  Conduct other business
4       Stand Alone Agent

In [38]:
dat2=pd.read_csv("trainwid.csv")
test2=pd.read_csv("testwid.csv")

In [39]:
dat2.head()

   withdrawls_airtel_cash
0                    11.0
1                    15.0
2                     9.0
3                     8.0
4                    11.0

In [40]:
dat3=pd.read_csv("traindep.csv")
test3=pd.read_csv("testdep.csv")

In [41]:
dat3.head()

   deposits_airtel_cash
0                   7.0
1                  21.0
2                   7.0
3                   9.0
4                   9.0

In [42]:
dat4=pd.read_csv("trainHours.csv")
test4=pd.read_csv("testHours.csv")

In [43]:
dat4.head()

  trading_hours
0      12 hours
1      12 hours
2      12 hours
3      12 hours
4      12 hours

In [44]:
data['standalone_agent']=dat1['standalone_agent']
data['standalone_agent']=test1["standalone_agent"]

In [45]:
data['withdrawls_airtel_cash']=dat2['withdrawls_airtel_cash']
test['withdrawls_airtel_cash']=test2["withdrawls_airtel_cash"]

In [46]:
data['deposits_airtel_cash']=dat3['deposits_airtel_cash']
test['deposits_airtel_cash']=test3["deposits_airtel_cash"]

In [47]:
data['trading_hours']=dat4['trading_hours']
test['trading_hours']=test4["trading_hours"]

In [48]:
data.head()

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,borrowing,insurance,mobile_money_classification,district,region,ward,standalone_agent,withdrawls_airtel_cash,deposits_airtel_cash,trading_hours
0,5086,98,2,3,1,1,2,2,0,0,...,0,0,0,Kasulu,Kigoma,Bombo,Conduct other business,11.0,7.0,12 hours
1,1258,40,1,1,3,5,1,1,1,0,...,1,0,3,Zanzibar,Zanzibar,Chiponda,Conduct other business,15.0,21.0,12 hours
2,331,18,2,4,6,3,2,1,0,0,...,0,0,2,Morogoro Urban,Morogoro,Bupandwam'hela,Conduct other business,9.0,7.0,12 hours
3,6729,50,1,1,3,1,1,1,0,0,...,1,0,3,Karatu,Arusha,Bomba Mbili,Conduct other business,8.0,9.0,12 hours
4,8671,34,1,1,1,1,2,1,0,1,...,0,1,3,Mpanda,Rukwa,Bweleo,Conduct other business,11.0,9.0,12 hours

In [49]:
data.to_csv("all7train.csv")
test.to_csv("all7test.csv")